/******************************************************************************

                  版权所有 (C), 2001-2011, 华为技术有限公司

 ******************************************************************************
  文 件 名   : hrd_base_api.h
  版 本 号   : 初稿
  作    者   : w00146306
  生成日期   : 2013年7月2日
  最近修改   :
  功能描述   : 对外基础头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2013年7月2日
    作    者   : w00146306
    修改内容   : 创建文件

******************************************************************************/

#ifndef _MC_BASE_API_H
#define _MC_BASE_API_H


#include "hrd_mod_common_api.h"

/*----------------------------------------------*
 * 外部变量说明                                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/
#define MCSS_MOD_NAME               "unibsp"

/* number of bare mcss devices */


#define MCSS_MAX_CORE_NUM       16UL
#define MCSS_MAX_VCPU_NUM       32UL
#define MCSS_MAX_GRP_NUM        40UL



#define MCSS_MAX_VMID_NUM       8UL

#define MCSS_CACHE_LINE_SIZE    64UL

#pragma pack(4)
typedef struct tagMcssKernelStat  /* 本结构体一定要与用户态对应 */
{
    /* 关键信息计数 */
    UINT64 ullOpenDevCnt[MCSS_DEVS_NUM];    /**<  进程启动计数  */
    UINT64 ullCloseDevCnt[MCSS_DEVS_NUM];   /**<  进程关闭计数  */
    UINT64 ullSendSemCnt[MCSS_DEVS_NUM];    /**<  发送信号计数  */
    UINT64 ullPouSentCnt[64];               /**<  POU发送计数   */

    /* 接收正常计数 */
    UINT64 ullRecvPktOk;                    /**<  接收报文成功数  */
    UINT64 ullGeCnt;                        /**<  报文为GE计数    */
    UINT64 ullHdcpCnt;                      /**<  报文为HDCP计数  */
    UINT64 ullSendToGroupCnt;               /**<  报文为SendToGroup计数  */

    /* 错误计数 */
    UINT64 ullRecvPktErr;                   /**<  接收报文失败数  */
    UINT64 ullPoePacketNull;                /**<  报文为空计数    */
    UINT64 ullEnRingFailCnt;                /**<  入ring失败计数  */
    UINT64 ullFreeBuffErr;                  /**<  接收报文释放内存错误 */
}MCSS_KERNEL_STAT_S;
#pragma pack()

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/

#endif /*_MC_BASE_API_H*/

